---
layout : single
title : "CCNA 강의 10: Routing"
categories: Network
tag: [network]
sidebar:
    nav: "docs"
---

# Routing & Static, Default (2)

-  [x] static_03 : 기본 구조 설정
-  [x] static_03 : Router 비밀번호 설정
-  [x] static_02 : 3단계 routing

## Router Remout Service

### static_03 : 기본 구조 설정
##### PC1 IP 설정 , PC0 원격 연결 후 터미널 열기
<img src = "/images/network/packet_tracer/29.png">

실제의 PC에서 cmd의 명령어로 접근은 가능하나, console table의 명령어는 굉장히 복잡하기에, 이를 지원하는 원격 툴 프로그램이 필요함 (ex. PuTTY). 아래 사진의 Terminal Configuration에서 설정하는 것과 비슷한 내용들을 설정할 수 있음. <br><Br>
<img src = "/images/network/packet_tracer/28.png">

##### PC0 2단계까지 설정
모든 통신에 초록불이 들어온 것을 확인할 수 있음. 2단계까지 설정을 마친 후, show running-config를 통해 설정 내용 확인 후 startup-cofig에 내용을 복사하여 저장한다<br><Br>
<img src = "/images/network/packet_tracer/30.png">

Ping을 통해 Gateway와 PC1과의 통신이 원활한 지 확인<br><Br>
<img src = "/images/network/packet_tracer/31.png">

### static_03 : Router 비밀번호 설정

- **Console Password** : console 모드 진입에 대한 비밀번호로, 관리자 접근 제어이다.<br><br>
```
Router(conf)#line console 0         -> console 모드 진입
Router(conf-line)#password hello    -> password 설정
Router(conf-line)#login             -> password 활성화
```
<img src = "/images/network/packet_tracer/32.png">
<br>

- Virtual Terminal Password<br><br>
```
Router(conf)#line vty 0 4
Router(conf-line)#login
Router(conf-line)#password hello
```
<br>

- Enable Password<br><br>
```
Router(config)#enable password hello
```
<br>

- Secret Password<br><br>
```
Router(config)#enable secret hello
```

