---
layout : single
title : "CCNA 강의 10: ROM 모드 레지스터 설정 변경"
categories: nw
tag: [network]
sidebar:
    nav: "docs"
---

# Routing & Static, Default (3)

-  [x] static_03 : ROM mode register 주소 변경
-  [x] static_03 : 암호 분실 시 삭제 후 접속
-  [x] static_03 : 라우터 계정 활용
-  [x] static_03 : VTY Password
-  [x] static_03 : SSH를 이용한 암호화 통신

## ROM mode
비밀번호를 까먹어서 접속 자체를 할 수 없다면 ? ROM mode(컴퓨터의 안전모드)에서 재설정 <br><br>
ROM mode : 부팅 시(완료되기 전) 들어갈 수 있음 (Ctrl + Break(pause) / Ctrl + c)

### static_03 : ROM mode register 주소 변경

##### ROM 모드 접속
<img src = "/images/network/packet_tracer/39.png">

##### show version을 이용한 register 주소 확인

```
rommon > reset                              -> reload와 같은 역할
Router> enable                              
Password :
Router# copy startup-config running-config
Router# show version                        -> router에 대한 기본 정보
```

show version의 정보 중 지금껏 설정한 것들이 저장되는 register의 주소<br><br>
<img src = "/images/network/packet_tracer/40.png">


##### register 주소 변경 및 확인

```
Router# conf t                              -> configuration terminal
Router(config)# config-register 0x2142      -> global 모드에서 register 주소 바꾸기
Router(config)# exit
Router# copy r s
Router# show version
```

register의 주소 바꾸기<br><br>
<img src = "/images/network/packet_tracer/41.png">

재부팅을 하기 이전에는 register의 주소가 바뀌지 않으며, 재부팅 시 주소가 바뀔 것이라는 문구가 나온다<br><br>
<img src = "/images/network/packet_tracer/42.png">

재부팅을 하면 주소는 0x2142로 표기되지만, 이 때 저장을 하면, 기존의 주소인 0x2102의 정보가 저장이 된다. 0x2142는 임시방편일 뿐이다.

---

### static_03 : 암호 분실 시 삭제 후 접속
##### 암호를 기억하지 못하게 설정
<img src = "/images/network/packet_tracer/43.png">


##### ROM 모드 접속 후 register 주소 변경

```
rommon 1> confreg 0x2142        -> Rom 모드에서 register 주소 바꾸기
rommon 2> reset
```
<img src = "/images/network/packet_tracer/44.png"> <br> <br>
재부팅된 상태에서 config-register 값을 임의의 값으로 다시 변경한 후, secret 값을 재설정 및 저장하고 reload 한다. <br>

\* *단, 이 경우 비밀번호를 제외한 나머지 설정값은 모두 초기화되므로, 다시 기본 설정을 진행해야 함*

##### 모든 설정이 잘못되었을 경우 재초기화하는 법

```
Router> en
Router# erase startup-config
```

---

### static_03 : 라우터 계정 활용
<img src = "/images/network/packet_tracer/45.png"> <br> <br>
로컬계정은 sw, 비밀번호는 sw1로 설정하였다. login local은 반드시 로컬 계정으로 로그인 접근하라는 의미로, 계정 삭제 시, 반드시 삭제 후, no login local 설정을 같이 적용해주어야 한다. (설정하지 않을 경우, 계정을 삭제했음에도 인증은 반드시 로컬 계정으로 인증 접근하라고 뜨기 때문에, 접근이 불가하다)<br> <br>

<img src = "/images/network/packet_tracer/46.png"> <br> <br>
reload 시 설정한 로컬 계정으로 로그인 필요

---

### static_03 :  VTY Password

Telnet을 사용하여 장비로 접근하는 것을 제한 (가상 터미널 접근 제어)

```
Router(config)# line vty 0 4        -> 가상모드 0~4번 (5개)
Router(config-line)#
```
##### 5개에 대한 비밀번호를 모두 설정한 후, login(비밀번호 활성화)
<img src = "/images/network/packet_tracer/47.png"> <br> <br>

##### 가상 원격 접속하기 + 접속 끊기
<img src = "/images/network/packet_tracer/48.png"> <br> <br>
telnet으로 가상 원격 접속을 할 경우, enable의 비밀번호가 설정되어 있지 않으면 접속할 수 없다. 가상 접속의 경우 여러 개를 한 번에 돌릴 수 있기 때문에, 보안상 필요한 것. (enable 비밀번호 설정은 필수적으로 해주어야 한다)

##### PC1에서 라우터 가상 접속하기
<img src = "/images/network/packet_tracer/49.png"> <br> <br>

---

### static_03 : SSH를 이용한 암호화 통신

보안 암호화 -> 암호화 알고리즘을 사용함

##### 계정 생성
<img src = "/images/network/packet_tracer/50.png"> <br>

username : seowon<br>
privilege(접속 권한 레벨) : 15 (사용자 - 1, 관리자 - 15)<br>
secret(암호) : sw0<br>
domain-name : seowon.com<br>
암호화 방식 : rsa<br>
key size : 1024<br>

##### 가상 터미널에서 SSH로 접속하도록 (현재는 telnet)
<img src = "/images/network/packet_tracer/51.png"> <br>

기존에 telnet으로 되어 있던 가상모드를 transport input ssh를 통해 ssh로 변경 후, ssh를 버전 2로 활성화한다 (버전 1은 너무 예전 거라 버전 2로 해야 제대로 이용 가능)

##### PC1에서 ssh 가상 접속하기
-l : 계정으로 접속한다는 의미<br> <br>
<img src = "/images/network/packet_tracer/52.png"> <br>